morfredus/ESP32-Diagnostic/src/main.cpp
void oledStepHorizontalLines() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  for (int i = 0; i < SCREEN_HEIGHT; i += 4) {
    oled.drawLine(0, i, SCREEN_WIDTH - 1, i);
  }
  oled.sendBuffer();
  delay(350);
}

void oledStepDiagonals() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  for (int i = 0; i < SCREEN_WIDTH; i += 8) {
    oled.drawLine(0, 0, i, SCREEN_HEIGHT - 1);
    oled.drawLine(SCREEN_WIDTH - 1, 0, i, SCREEN_HEIGHT - 1);
  }
  oled.sendBuffer();
  delay(350);
}

void oledStepMovingSquare() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  for (int x = 0; x < SCREEN_WIDTH - 20; x += 6) {
    oled.clearBuffer();
    oled.drawBox(x, 22, 20, 20);
    oled.sendBuffer();
    delay(12);
    yield();
  }
}

void oledStepProgressBar() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  String loadingText = String(Texts::loading);
  oled.drawStr(20, 15, loadingText.c_str());
  oled.sendBuffer();

  for (int i = 0; i <= 100; i += 10) {
    oled.clearBuffer();
    oled.setFont(u8g2_font_6x10_tf);
    oled.drawStr(20, 15, loadingText.c_str());
    oled.drawFrame(10, 30, 108, 15);
    oled.drawBox(12, 32, i, 11);
    char buf[8];
    snprintf(buf, sizeof(buf), "%d%%", i);
    oled.drawStr(45, 55, buf);
    oled.sendBuffer();
    delay(45);
    yield();
  }
  delay(300);
}

void oledStepScrollText() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  String scrollText = "  DIAGNOSTIC ESP32 COMPLET - OLED 0.96 pouces I2C  ";
  int textWidth = scrollText.length() * 6;
  for (int offset = 0; offset < textWidth; offset += 6) {
    oled.clearBuffer();
    oled.setFont(u8g2_font_6x10_tf);
    oled.setCursor(-offset, 35);
    oled.print(scrollText);
    oled.sendBuffer();
    delay(12);
    yield();
  }
}

void oledStepFinalMessage() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(30, 30, "TEST OK!");
  oled.drawFrame(0, 0, SCREEN_WIDTH, SCREEN_HEIGHT);
  oled.sendBuffer();
  delay(600);
  oled.clearBuffer();
  oled.sendBuffer();
}

bool performOLEDStep(const String &stepId) {
  if (!oledAvailable) {
    return false;
  }

  if (stepId == "welcome") {
    oledStepWelcome();
  } else if (stepId == "big_text") {
    oledStepBigText();
  } else if (stepId == "text_sizes") {
    oledStepTextSizes();
  } else if (stepId == "shapes") {
    oledStepShapes();
  } else if (stepId == "horizontal_lines") {
    oledStepHorizontalLines();
  } else if (stepId == "diagonals") {
    oledStepDiagonals();
  } else if (stepId == "moving_square") {
    oledStepMovingSquare();
  } else if (stepId == "progress_bar") {
    oledStepProgressBar();
  } else if (stepId == "scroll_text") {
    oledStepScrollText();
  } else if (stepId == "final_message") {
    oledStepFinalMessage();
  } else {
    return false;
  }

  return true;
}

String getOLEDStepLabel(const String &stepId) {
  if (stepId == "welcome") return String(Texts::oled_step_welcome);
  if (stepId == "big_text") return String(Texts::oled_step_big_text);
  if (stepId == "text_sizes") return String(Texts::oled_step_text_sizes);
  if (stepId == "shapes") return String(Texts::oled_step_shapes);
  if (stepId == "horizontal_lines") return String(Texts::oled_step_horizontal_lines);
  if (stepId == "diagonals") return String(Texts::oled_step_diagonals);
  if (stepId == "moving_square") return String(Texts::oled_step_moving_square);
  if (stepId == "progress_bar") return String(Texts::oled_step_progress_bar);
  if (stepId == "scroll_text") return String(Texts::oled_step_scroll_text);
  if (stepId == "final_message") return String(Texts::oled_step_final_message);
  return stepId;
}

void testOLED() {
  if (!oledAvailable || oledTested) return;

  Serial.println("\r\n=== TEST OLED ===");

  oledStepWelcome();
  oledStepBigText();
  oledStepTextSizes();
  oledStepShapes();
  oledStepHorizontalLines();
  oledStepDiagonals();
  oledStepMovingSquare();
  oledStepProgressBar();
  oledStepScrollText();
  oledStepFinalMessage();

  oledTested = true;
  // [OPT-009]: Buffer-based test result (1 vs 3 allocations)
  char oledBuf[96];
  snprintf(oledBuf, sizeof(oledBuf), "%s %s - 128x64", Texts::test.str().c_str(), Texts::ok.str().c_str());
  oledTestResult = String(oledBuf);
  Serial.println("OLED: Tests complets OK\r\n");
}

void resetOLEDTest() {
  oledTested = false;
  if (oledAvailable) {
    oled.clearBuffer();
    oled.sendBuffer();
  }
}

void oledShowMessage(String message) {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(0, 10, message.c_str());
  oled.sendBuffer();
}

// WiFi connection status banner on OLED
void oledShowWiFiStatus(const String& title,
                        const String& detail,
                        const String& footer,
                        int progressPercent) {
  if (!oledAvailable) {
    return;
  }

  int clampedProgress = progressPercent;
  if (clampedProgress < 0) {
    clampedProgress = -1;
  } else if (clampedProgress > 100) {
    clampedProgress = 100;
  }

  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(0, 12, title.c_str());

  if (detail.length() > 0) {
    oled.drawStr(0, 28, detail.c_str());
  }

  if (footer.length() > 0) {
    oled.drawStr(0, 44, footer.c_str());
  }

  if (clampedProgress >= 0) {
    const int barX = 8;
    const int barY = 52;
    const int barWidth = SCREEN_WIDTH - (barX * 2);
    const int barHeight = 10;
    oled.drawFrame(barX, barY, barWidth, barHeight);
    int fillWidth = (barWidth - 2) * clampedProgress / 100;
    if (fillWidth > 0) {
      oled.drawBox(barX + 1, barY + 1, fillWidth, barHeight - 2);
    }
  }

  oled.sendBuffer();
}

// ========== TEST TFT ==========
// Individual TFT test steps
void tftStepBoot() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  displayBootSplash();
  delay(1000);
#endif
}

void tftStepColors() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
